CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFixedBed/CFD/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 296;

boundaryField
{
    inlet
    {
        type             fixedValue;
        value            uniform 296;
    }
    outlet
    {
       type             zeroGradient;
    }
    walls
    {
       type             zeroGradient;
    }
    magnet
    {
       type             zeroGradient;
    }    
    frontAndBackPlanes
    {
       type             zeroGradient;
    }
}

// ************************************************************************* //
