CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFixedBed/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                fixedValue;
	value		     uniform (0 0 0);
        /*uniformValue        table
                            (
                               (0.0 (0 0.1 0))
                               (10.0 (0 2.5 0))
                               (20.0 (0 0.1 0))
                               (30.0 (0 2.5 0))
                               (40.0 (0 0.1 0))
                            );*/
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            slip;
    }
    magnet
    {
        type            slip;
    }
    frontAndBackPlanes
    {
        type            slip;
    }
}

// ************************************************************************* //

