CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFixedBed/CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
     inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type               kqRWallFunction;
        value              $internalField;
    }
    magnet
    {
        type               kqRWallFunction;
        value              $internalField;
    }
    frontAndBackPlanes
    {
        type               kqRWallFunction;
        value              $internalField;
    }
}


// ************************************************************************* //
