CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFixedBed/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       8192;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       8352;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          576;
        startFace       8512;
    }
)

// ************************************************************************* //
